cf_billing/Documents/энргДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргДополнительныеНачисления</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргДополнительныеНачисления/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДанныеОплаты() Экспорт
	
	ГраницыОтчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	НачалоОтчПериода 	= ГраницыОтчетногоПериода.НачалоОП;	

	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Строение", 			МКД);
	Запрос.УстановитьПараметр("Дата", 				НачалоОтчПериода);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ОбъемНачислений", 	ЭтотОбъект.Движения.энргОбъемНачислений.Выгрузить());
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	&Район КАК Район,
	|	ОбъемНачислений.Строение КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Период КАК Дата,
	|	&Ссылка КАК ДокРегистратор,
	|	ОбъемНачислений.Сумма КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.КлючПомещения КАК КлючПомещения,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Дата КАК Дата,
	|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СУММА(ОбъемНачислений.СуммаОплаты) КАК СуммаОплаты,
	|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Организация,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.Район,
	|	ОбъемНачислений.ЭтоОплата,
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Дата,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	ОбъемНачислений.ДокРегистратор,
	|	ОбъемНачислений.Поставщик";
 
	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Ответственный 			= Пользователи.ТекущийПользователь();	
 
	Движения.энргОбъемНачислений.ДополнительныеСвойства.Вставить("НеПересчитыватьСумму", Истина);
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	ГраницыОП	= энргГраницыПериодаНачисленияМенеджерВызовСервера.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);
	Для Каждого СтрокаНабора Из Движения.энргОбъемНачислений Цикл
		СтрокаНабора.Период 		= Дата;
		СтрокаНабора.Активность 	= Истина;
		СтрокаНабора.ПериодРасчета 	= ПериодНачисления;		
		СтрокаНабора.Район			= Район;
		СтрокаНабора.Организация 	= Организация;
		СтрокаНабора.ВидНачисления 	= Перечисления.энргВидыНачислений.Начисление;
		СтрокаНабора.НачалоПериода  = ГраницыОП.НачалоОП;                                        
		СтрокаНабора.КонецПериода   = ГраницыОП.ЗавершениеОП;
		
		Если не ЗначениеЗаполнено(СтрокаНабора.Поставщик) Тогда 
			СтрокаНабора.Поставщик = Константы.энргПоставщикПоУмолчанию.Получить();
		КонецЕсли;
		
	КонецЦикла;

	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);
	ДополнительныеСвойства.Вставить("ПараметрыПроведения",			Новый Структура());
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			Справочники.энргИсточникиПоступления.Касса);
	ДополнительныеСвойства.Вставить("Кассир", 						Справочники.энргКонтрагенты.ПустаяСсылка());
	ДополнительныеСвойства.Вставить("МКД", 		 					МКД);
	
	ВрТабЗначенийАбоненты = Движения.энргОбъемНачислений.Выгрузить();
	Движения.энргВзаиморасчеты.Очистить();
	Для Каждого Стр Из ВрТабЗначенийАбоненты Цикл
		
		Строканабора = Движения.энргВзаиморасчеты.Добавить();
		ЗаполнитьЗначенияСвойств(Строканабора, Стр);
		Строканабора.Сумма 		= Стр.Сумма;
		Строканабора.Абонент 	= Стр.Абонент;
		СтрокаНабора.Период 	= Дата;
		СтрокаНабора.Активность	= Истина;
		СтрокаНабора.МКД 		= ?(Стр.ЧастныйСектор, Справочники.энргСтроения.ПустаяСсылка(), Стр.Строение);
		
	КонецЦикла;

	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;		
	КонецЕсли;
 
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
